app/controllers/service_masters_controller.rb

  def index
    @service_masters = ServiceMaster.all
---
SELECT * FROM "service_masters"

  def show
    @service_master = ServiceMaster.find(params[:id])
---
SELECT * FROM "service_masters" WHERE ("service_masters"."id" = 1)

  def edit
    @service_master = ServiceMaster.find(params[:id])
---
SELECT * FROM "service_masters" WHERE ("service_masters"."id" = 1)

  def create
    @service_master = ServiceMaster.new(params[:service_master])

    respond_to do |format|
      if @service_master.save
---
INSERT INTO "service_masters" ("total_cost", "updated_at", "servicer", "hrs_actual", "status_code", "service_desc", "hrs_est", "created_at") VALUES(NULL, '2010-02-03 00:59:10', '', NULL, '', '', NULL, '2010-02-03 00:59:10')

  def update
    @service_master = ServiceMaster.find(params[:id])

    respond_to do |format|
      if @service_master.update_attributes(params[:service_master])
---
SELECT * FROM "service_masters" WHERE ("service_masters"."id" = 1)
UPDATE "service_masters" SET "status_code" = 'AN', "service_desc" = 'test1', "updated_at" = '2010-02-03 01:06:51' WHERE "id" = 1

  def destroy
    @service_master = ServiceMaster.find(params[:id])
    @service_master.destroy
---
SELECT * FROM "service_masters" WHERE ("service_masters"."id" = 2)
DELETE FROM "service_masters" WHERE "id" = 2